GY-IT/stm32fl03c8t6/5-2外部中断旋转编码/HardWare/Encoder.c
#include "stm32f10x.h"                  // Device header

int16_t Encoder_Count;
//旋转计数 GPIOB 的 GPIO_Pin_0 GPIO_Pin_1
void Encoder_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1 ;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource0);
	GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource1);
	
	EXTI_InitTypeDef EXTI_InitStructure;
	EXTI_InitStructure.EXTI_Line = EXTI_Line0|EXTI_Line1;
	EXTI_InitStructure.EXTI_LineCmd =  ENABLE;
	EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
	EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
	EXTI_Init(&EXTI_InitStructure);
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructurce;
	NVIC_InitStructurce.NVIC_IRQChannel = EXTI0_IRQn;
	NVIC_InitStructurce.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructurce.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructurce.NVIC_IRQChannelSubPriority = 1;
	NVIC_Init(&NVIC_InitStructurce);
	NVIC_InitStructurce.NVIC_IRQChannel = EXTI1_IRQn;
	NVIC_InitStructurce.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructurce.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructurce.NVIC_IRQChannelSubPriority = 2;
	NVIC_Init(&NVIC_InitStructurce);
}


uint16_t Encoder_Get(void)
{
	int16_t Temp;
	Temp = Encoder_Count;
	Encoder_Count = 0;
	return Temp;
}

void EXTI0_IRQHandler (void)
{
	if(EXTI_GetITStatus(EXTI_Line0) == SET)
	{
		if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_1) == 0)
		{
			Encoder_Count--;
		}	
		EXTI_ClearITPendingBit(EXTI_Line0);
	}	
}

void EXTI1_IRQHandler (void)
{
	if(EXTI_GetITStatus(EXTI_Line1) == SET)
	{
		if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_0) == 0)
		{
			Encoder_Count++;
		}
		
		EXTI_ClearITPendingBit(EXTI_Line1);
	}
	
}

